HW2/rails-intro/app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG'))
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (0, 0) ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date
---
  def index
    @all_ratings=Movie.uniq.pluck(:rating)#['G','PG','PG-13','R']
    @rate=@all_ratings if @rate==nil
       sortie=params[:sort]
       if sortie==nil
         @movies = Movie.all
       else
         @movies = Movie.find(:all,:order => sortie)
       end
       rf=params[:commit]
       @rate=params[:ratings].keys unless params[:ratings]==nil #['G','PG']
       if rf=="Refresh"
         @movies = Movie.find(:all,:conditions => ["rating IN (?)",@rate])